<!DOCTYPE html>
<html>
<head>
    <title>Моя PHP-програма</title>
</head>
<body>
<?php
// Отримання параметрів з GET-запиту або встановлення значень за замовчуванням
$a = isset($_GET['a']) ? $_GET['a'] : 0;
$b = isset($_GET['b']) ? $_GET['b'] : 0;
$c = isset($_GET['c']) ? $_GET['c'] : 0;

// Обчислення результату
$rez = $a * $b * $c;

// Виведення результату
echo "Результат: " . $rez;
?>
<br />

<!-- Гіперпосилання для передачі параметрів -->
<a href="?aa=2&b=7&c=5">2 * 7 * 5</a><br/>
<a href="?a=10&b=2&c=8">10 * 2 * 8</a><br />
<a href="?a=3&b=1&c=5">3 * 1 * 5</a><br />

</body>
</html>
